---
kind: type
id: T:Autodesk.Revit.DB.AllowedValues
source: html/a777713f-d3be-3c45-29ee-09f9c7a83d9f.htm
---
# Autodesk.Revit.DB.AllowedValues

A range of allowed values.

## Syntax (C#)
```csharp
public enum AllowedValues
```